[
    {
        "cve_id":  "CVE-2015-9235",
        "package":  "jsonwebtoken",
        "version":  "0.1.0",
        "severity":  "CRITICAL",
        "title":  "nodejs-jsonwebtoken: verification step bypass with an altered token",
        "url":  "https://avd.aquasec.com/nvd/cve-2015-9235",
        "description":  "In jsonwebtoken node module before 4.2.2 it is possible for an attacker to bypass verification when a token digitally signed with an asymmetric key (RS/ES family) of algorithms but instead the attacker send a token digitally signed with a symmetric algorithm (HS* family)."
    },
    {
        "cve_id":  "CVE-2019-10744",
        "package":  "lodash",
        "version":  "2.4.2",
        "severity":  "CRITICAL",
        "title":  "nodejs-lodash: prototype pollution in defaultsDeep function leading to modifying properties",
        "url":  "https://avd.aquasec.com/nvd/cve-2019-10744",
        "description":  "Versions of lodash lower than 4.17.12 are vulnerable to Prototype Pollution. The function defaultsDeep could be tricked into adding or modifying properties of Object.prototype using a constructor payload."
    },
    {
        "cve_id":  "CVE-2023-32314",
        "package":  "vm2",
        "version":  "3.9.17",
        "severity":  "CRITICAL",
        "title":  "vm2: Sandbox Escape",
        "url":  "https://avd.aquasec.com/nvd/cve-2023-32314",
        "description":  "vm2 is a sandbox that can run untrusted code with Node\u0027s built-in modules. A sandbox escape vulnerability exists in vm2 for versions up to and including 3.9.17. It abuses an unexpected creation of a host object based on the specification of `Proxy`. As a result a threat actor can bypass the sandbox protections to gain remote code execution rights on the host running the sandbox. This vulnerability was patched in the release of version `3.9.18` of `vm2`. Users are advised to upgrade. There are no known workarounds for this vulnerability."
    },
    {
        "cve_id":  "CVE-2023-37466",
        "package":  "vm2",
        "version":  "3.9.17",
        "severity":  "CRITICAL",
        "title":  "vm2: Promise handler sanitization can be bypassed allowing attackers to escape the sandbox and run arbitrary code",
        "url":  "https://avd.aquasec.com/nvd/cve-2023-37466",
        "description":  "vm2 is an advanced vm/sandbox for Node.js. The library contains critical security issues and should not be used for production. The maintenance of the project has been discontinued. In vm2 for versions up to 3.9.19, `Promise` handler sanitization can be bypassed with the `@@species` accessor property allowing attackers to escape the sandbox and run arbitrary code, potentially allowing remote code execution inside the context of vm2 sandbox."
    },
    {
        "cve_id":  "CVE-2023-37903",
        "package":  "vm2",
        "version":  "3.9.17",
        "severity":  "CRITICAL",
        "title":  "vm2: custom inspect function allows attackers to escape the sandbox and run arbitrary code",
        "url":  "https://avd.aquasec.com/nvd/cve-2023-37903",
        "description":  "vm2 is an open source vm/sandbox for Node.js. In vm2 for versions up to and including 3.9.19, Node.js custom inspect function allows attackers to escape the sandbox and run arbitrary code. This may result in Remote Code Execution, assuming the attacker has arbitrary code execution primitive inside the context of vm2 sandbox. There are no patches and no known workarounds. Users are advised to find an alternative software."
    },
    {
        "cve_id":  "CVE-2023-46233",
        "package":  "crypto-js",
        "version":  "3.3.0",
        "severity":  "CRITICAL",
        "title":  "crypto-js: PBKDF2 1,000 times weaker than specified in 1993 and 1.3M times weaker than current standard",
        "url":  "https://avd.aquasec.com/nvd/cve-2023-46233",
        "description":  "crypto-js is a JavaScript library of crypto standards. Prior to version 4.2.0, crypto-js PBKDF2 is 1,000 times weaker than originally specified in 1993, and at least 1,300,000 times weaker than current industry standard. This is because it both defaults to SHA1, a cryptographic hash algorithm considered insecure since at least 2005, and defaults to one single iteration, a \u0027strength\u0027 or \u0027difficulty\u0027 value specified at 1,000 when specified in 1993. PBKDF2 relies on iteration count as a countermeasure to preimage and collision attacks. If used to protect passwords, the impact is high. If used to generate signatures, the impact is high. Version 4.2.0 contains a patch for this issue. As a workaround, configure crypto-js to use SHA256 with at least 250,000 iterations."
    },
    {
        "cve_id":  "GHSA-5mrr-rgp6-x4gr",
        "package":  "marsdb",
        "version":  "0.6.11",
        "severity":  "CRITICAL",
        "title":  "Command Injection in marsdb",
        "url":  "https://github.com/advisories/GHSA-5mrr-rgp6-x4gr",
        "description":  "All versions of `marsdb` are vulnerable to Command Injection. In the `DocumentMatcher` class, selectors on `$where` clauses are passed to a Function constructor unsanitized. This allows attackers to run arbitrary commands in the system when the function is executed.\n\n\n## Recommendation\n\nNo fix is currently available. Consider using an alternative package until a fix is made available."
    },
    {
        "cve_id":  "CVE-2016-1000223",
        "package":  "jws",
        "version":  "0.2.6",
        "severity":  "HIGH",
        "title":  "Forgeable Public/Private Tokens",
        "url":  "https://avd.aquasec.com/nvd/cve-2016-1000223",
        "description":  "Since \"algorithm\" isn\u0027t enforced in `jws.verify()`, a malicious user could choose what algorithm is sent to the server. If the server is expecting RSA but is sent HMAC-SHA with RSA\u0027s public key, the server will think the public key is actually an HMAC private key. This could be used to forge any data an attacker wants.\n\nIn addition, there is the `none` algorithm to be concerned about.  In versions prior to 3.0.0, verification of the token could be bypassed when the `alg` field is set to `none`.\n\n*Edit ( 7/29/16 ): A previous version of this advisory incorrectly stated that the vulnerability was patched in version 2.0.0 instead of 3.0.0. The advisory has been updated to reflect this new information. Thanks to Fabien Catteau for reporting the error.*"
    },
    {
        "cve_id":  "CVE-2017-18214",
        "package":  "moment",
        "version":  "2.0.0",
        "severity":  "HIGH",
        "title":  "nodejs-moment: Regular expression denial of service",
        "url":  "https://avd.aquasec.com/nvd/cve-2017-18214",
        "description":  "The moment module before 2.19.3 for Node.js is prone to a regular expression denial of service via a crafted date string, a different vulnerability than CVE-2016-4055."
    },
    {
        "cve_id":  "CVE-2018-16487",
        "package":  "lodash",
        "version":  "2.4.2",
        "severity":  "HIGH",
        "title":  "lodash: Prototype pollution in utilities function",
        "url":  "https://avd.aquasec.com/nvd/cve-2018-16487",
        "description":  "A prototype pollution vulnerability was found in lodash \u003c4.17.11 where the functions merge, mergeWith, and defaultsDeep can be tricked into adding or modifying properties of Object.prototype."
    },
    {
        "cve_id":  "CVE-2020-15084",
        "package":  "express-jwt",
        "version":  "0.1.3",
        "severity":  "HIGH",
        "title":  "Authorization bypass in express-jwt",
        "url":  "https://avd.aquasec.com/nvd/cve-2020-15084",
        "description":  "In express-jwt (NPM package) up and including version 5.3.3, the algorithms entry to be specified in the configuration is not being enforced. When algorithms is not specified in the configuration, with the combination of jwks-rsa, it may lead to authorization bypass. You are affected by this vulnerability if all of the following conditions apply: - You are using express-jwt - You do not have **algorithms** configured in your express-jwt configuration. - You are using libraries such as jwks-rsa as the **secret**. You can fix this by specifying **algorithms** in the express-jwt configuration. See linked GHSA for example. This is also fixed in version 6.0.0."
    },
    {
        "cve_id":  "CVE-2020-8203",
        "package":  "lodash.set",
        "version":  "4.3.2",
        "severity":  "HIGH",
        "title":  "nodejs-lodash: prototype pollution in zipObjectDeep function",
        "url":  "https://avd.aquasec.com/nvd/cve-2020-8203",
        "description":  "Prototype pollution attack when using _.zipObjectDeep in lodash before 4.17.20."
    },
    {
        "cve_id":  "CVE-2021-23337",
        "package":  "lodash",
        "version":  "2.4.2",
        "severity":  "HIGH",
        "title":  "nodejs-lodash: command injection via template",
        "url":  "https://avd.aquasec.com/nvd/cve-2021-23337",
        "description":  "Lodash versions prior to 4.17.21 are vulnerable to Command Injection via the template function."
    },
    {
        "cve_id":  "CVE-2022-23539",
        "package":  "jsonwebtoken",
        "version":  "0.1.0",
        "severity":  "HIGH",
        "title":  "jsonwebtoken: Unrestricted key type could lead to legacy keys usagen",
        "url":  "https://avd.aquasec.com/nvd/cve-2022-23539",
        "description":  "Versions `\u003c=8.5.1` of `jsonwebtoken` library could be misconfigured so that legacy, insecure key types are used for signature verification. For example, DSA keys could be used with the RS256 algorithm. You are affected if you are using an algorithm and a key type other than a combination listed in the GitHub Security Advisory as unaffected. This issue has been fixed, please update to version 9.0.0. This version validates for asymmetric key type and algorithm combinations. Please refer to the above mentioned algorithm / key type combinations for the valid secure configuration. After updating to version 9.0.0, if you still intend to continue with signing or verifying tokens using invalid key type/algorithm value combinations, you’ll need to set the `allowInvalidAsymmetricKeyTypes` option  to `true` in the `sign()` and/or `verify()` functions."
    },
    {
        "cve_id":  "CVE-2022-24785",
        "package":  "moment",
        "version":  "2.0.0",
        "severity":  "HIGH",
        "title":  "Moment.js: Path traversal  in moment.locale",
        "url":  "https://avd.aquasec.com/nvd/cve-2022-24785",
        "description":  "Moment.js is a JavaScript date library for parsing, validating, manipulating, and formatting dates. A path traversal vulnerability impacts npm (server) users of Moment.js between versions 1.0.1 and 2.29.1, especially if a user-provided locale string is directly used to switch moment locale. This problem is patched in 2.29.2, and the patch can be applied to all affected versions. As a workaround, sanitize the user-provided locale name before passing it to Moment.js."
    },
    {
        "cve_id":  "CVE-2022-25881",
        "package":  "http-cache-semantics",
        "version":  "3.8.1",
        "severity":  "HIGH",
        "title":  "http-cache-semantics: Regular Expression Denial of Service (ReDoS) vulnerability",
        "url":  "https://avd.aquasec.com/nvd/cve-2022-25881",
        "description":  "This affects versions of the package http-cache-semantics before 4.1.1. The issue can be exploited via malicious request header values sent to a server, when that server reads the cache policy from the request using this library."
    },
    {
        "cve_id":  "CVE-2022-25887",
        "package":  "sanitize-html",
        "version":  "1.4.2",
        "severity":  "HIGH",
        "title":  "sanitize-html: insecure global regular expression replacement logic may lead to ReDoS",
        "url":  "https://avd.aquasec.com/nvd/cve-2022-25887",
        "description":  "The package sanitize-html before 2.7.1 are vulnerable to Regular Expression Denial of Service (ReDoS) due to insecure global regular expression replacement logic of HTML comment removal."
    },
    {
        "cve_id":  "CVE-2024-29415",
        "package":  "ip",
        "version":  "2.0.1",
        "severity":  "HIGH",
        "title":  "node-ip: Incomplete fix for CVE-2023-42282",
        "url":  "https://avd.aquasec.com/nvd/cve-2024-29415",
        "description":  "The ip package through 2.0.1 for Node.js might allow SSRF because some IP addresses (such as 127.1, 01200034567, 012.1.2.3, 000:0:0000::01, and ::fFFf:127.0.0.1) are improperly categorized as globally routable via isPublic. NOTE: this issue exists because of an incomplete fix for CVE-2023-42282."
    },
    {
        "cve_id":  "CVE-2024-37890",
        "package":  "ws",
        "version":  "7.4.6",
        "severity":  "HIGH",
        "title":  "nodejs-ws: denial of service when handling a request with many HTTP headers",
        "url":  "https://avd.aquasec.com/nvd/cve-2024-37890",
        "description":  "ws is an open source WebSocket client and server for Node.js. A request with a number of headers exceeding theserver.maxHeadersCount threshold could be used to crash a ws server. The vulnerability was fixed in ws@8.17.1 (e55e510) and backported to ws@7.5.10 (22c2876), ws@6.2.3 (eeb76d3), and ws@5.2.4 (4abd8f6). In vulnerable versions of ws, the issue can be mitigated in the following ways: 1. Reduce the maximum allowed length of the request headers using the --max-http-header-size=size and/or the maxHeaderSize options so that no more headers than the server.maxHeadersCount limit can be sent. 2. Set server.maxHeadersCount to 0 so that no limit is applied."
    },
    {
        "cve_id":  "CVE-2024-4068",
        "package":  "braces",
        "version":  "2.3.2",
        "severity":  "HIGH",
        "title":  "braces: fails to limit the number of characters it can handle",
        "url":  "https://avd.aquasec.com/nvd/cve-2024-4068",
        "description":  "The NPM package `braces`, versions prior to 3.0.3, fails to limit the number of characters it can handle, which could lead to Memory Exhaustion. In `lib/parse.js,` if a malicious user sends \"imbalanced braces\" as input, the parsing will enter a loop, which will cause the program to start allocating heap memory without freeing it at any moment of the loop. Eventually, the JavaScript heap limit is reached, and the program will crash."
    },
    {
        "cve_id":  "CVE-2025-47935",
        "package":  "multer",
        "version":  "1.4.5-lts.2",
        "severity":  "HIGH",
        "title":  "Multer vulnerable to Denial of Service via memory leaks from unclosed streams",
        "url":  "https://avd.aquasec.com/nvd/cve-2025-47935",
        "description":  "Multer is a node.js middleware for handling `multipart/form-data`. Versions prior to 2.0.0 are vulnerable to a resource exhaustion and memory leak issue due to improper stream handling. When the HTTP request stream emits an error, the internal `busboy` stream is not closed, violating Node.js stream safety guidance. This leads to unclosed streams accumulating over time, consuming memory and file descriptors. Under sustained or repeated failure conditions, this can result in denial of service, requiring manual server restarts to recover. All users of Multer handling file uploads are potentially impacted. Users should upgrade to 2.0.0 to receive a patch. No known workarounds are available."
    },
    {
        "cve_id":  "CVE-2025-47944",
        "package":  "multer",
        "version":  "1.4.5-lts.2",
        "severity":  "HIGH",
        "title":  "Multer vulnerable to Denial of Service from maliciously crafted requests",
        "url":  "https://avd.aquasec.com/nvd/cve-2025-47944",
        "description":  "Multer is a node.js middleware for handling `multipart/form-data`. A vulnerability that is present starting in version 1.4.4-lts.1 and prior to version 2.0.0 allows an attacker to trigger a Denial of Service (DoS) by sending a malformed multi-part upload request. This request causes an unhandled exception, leading to a crash of the process. Users should upgrade to version 2.0.0 to receive a patch. No known workarounds are available."
    },
    {
        "cve_id":  "CVE-2025-4802",
        "package":  "libc6",
        "version":  "2.36-9+deb12u10",
        "severity":  "HIGH",
        "title":  "glibc: static setuid binary dlopen may incorrectly search LD_LIBRARY_PATH",
        "url":  "https://avd.aquasec.com/nvd/cve-2025-4802",
        "description":  "Untrusted LD_LIBRARY_PATH environment variable vulnerability in the GNU C Library version 2.27 to 2.38 allows attacker controlled loading of dynamically shared library in statically compiled setuid binaries that call dlopen (including internal dlopen calls after setlocale or calls to NSS functions such as getaddrinfo)."
    },
    {
        "cve_id":  "CVE-2025-48997",
        "package":  "multer",
        "version":  "1.4.5-lts.2",
        "severity":  "HIGH",
        "title":  "multer: Multer vulnerable to Denial of Service via unhandled exception",
        "url":  "https://avd.aquasec.com/nvd/cve-2025-48997",
        "description":  "Multer is a node.js middleware for handling `multipart/form-data`. A vulnerability that is present starting in version 1.4.4-lts.1 and prior to version 2.0.1 allows an attacker to trigger a Denial of Service (DoS) by sending an upload file request with an empty string field name. This request causes an unhandled exception, leading to a crash of the process. Users should upgrade to `2.0.1` to receive a patch. No known workarounds are available."
    },
    {
        "cve_id":  "CVE-2025-59343",
        "package":  "tar-fs",
        "version":  "2.1.3",
        "severity":  "HIGH",
        "title":  "tar-fs: tar-fs symlink validation bypass",
        "url":  "https://avd.aquasec.com/nvd/cve-2025-59343",
        "description":  "tar-fs provides filesystem bindings for tar-stream. Versions prior to 3.1.1, 2.1.3, and 1.16.5 are vulnerable to symlink validation bypass if the destination directory is predictable with a specific tarball. This issue has been patched in version 3.1.1, 2.1.4, and 1.16.6. A workaround involves using the ignore option on non files/directories."
    },
    {
        "cve_id":  "CVE-2025-7338",
        "package":  "multer",
        "version":  "1.4.5-lts.2",
        "severity":  "HIGH",
        "title":  "multer: Multer Denial of Service",
        "url":  "https://avd.aquasec.com/nvd/cve-2025-7338",
        "description":  "Multer is a node.js middleware for handling `multipart/form-data`. A vulnerability that is present starting in version 1.4.4-lts.1 and prior to version 2.0.2 allows an attacker to trigger a Denial of Service (DoS) by sending a malformed multi-part upload request. This request causes an unhandled exception, leading to a crash of the process. Users should upgrade to version 2.0.2 to receive a patch. No known workarounds are available."
    },
    {
        "cve_id":  "NSWG-ECO-17",
        "package":  "jsonwebtoken",
        "version":  "0.1.0",
        "severity":  "HIGH",
        "title":  "Verification Bypass",
        "url":  null,
        "description":  "It is possible for an attacker to bypass verification when \"a token digitally signed with an asymetric key (RS/ES family) of algorithms but instead the attacker send a token digitally signed with a symmetric algorithm (HS* family)\" [1]"
    },
    {
        "cve_id":  "NSWG-ECO-428",
        "package":  "base64url",
        "version":  "0.0.6",
        "severity":  "HIGH",
        "title":  "Out-of-bounds Read",
        "url":  "https://hackerone.com/reports/321687",
        "description":  "`base64url` allocates uninitialized Buffers when number is passed in input on Node.js 4.x and below"
    }
]
